tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
//*--------------------------------------------------------------------------------------
//*                    RADM - Rotork Actuators Data acquisition Module
//*                         		(c) Synergy AST 2013
//*--------------------------------------------------------------------------------------
//* File Name           : RADM_system.c
//* Object              : system related and supporting functions
//* Creation            : Jiri Hofman 18/11/2013
//* Last modified       : Thomas Zhen 11/10/2021
//*--------------------------------------------------------------------------------------

//*--------------------------------------------------------------------------------------
//* Include external files
//*--------------------------------------------------------------------------------------
//#include "misc.h"
//#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "stm32_hal_legacy.h"
//#include "stm32f4xx_conf.h"
//#include "stm32f4xx_usart.h"
#include "stm32f4xx_hal_uart.h"
#include "system_stm32f4xx.h"
//#include "stm32f4xx_gpio.h"
//#include "stm32f4xx_rcc.h"
//#include "stm32f4xx_tim.h"
//#include "stm32f4xx_spi.h"
//#include "stm32f4xx_i2c.h"
#include "RADM_system.h"
#include "RADM_ports.h"
#include "RADM_macros.h"
#include "RADM_global.h"
#include "RADM_int.h"
#include <stdio.h>
#include <stdlib.h>

//*--------------------------------------------------------------------------------------
//* External References
//*--------------------------------------------------------------------------------------
//none
//*--------------------------------------------------------------------------------------
//* Definition of global variables
//*--------------------------------------------------------------------------------------
//none
TIM_HandleTypeDef htim3;
UART_HandleTypeDef huart;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart6;
UART_HandleTypeDef huart4;
TIM_HandleTypeDef htim3;
uint8_t buffer[15];
uint8_t rx_buff[15];
//*--------------------------------------------------------------------------------------
//* Definition of local variables
//*--------------------------------------------------------------------------------------
//none

//*--------------------------------------------------------------------------------------
//* Function Name         : SystemInitSetup
//* Object                : Initial setup of SFRs, global variables, peripheries etc
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void SystemInitSetup(void)
{
HAL_Init();

//NVIC_InitTypeDef NVIC_InitStruct;
//TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
//SPI_InitTypeDef SPI_InitStructure;
//I2C_InitTypeDef  I2C_InitStructure;
//RCC_ClocksTypeDef RCC_ClocksNow;
RCC_ClkInitTypeDef RCC_ClocksNow = {0};
RCC_OscInitTypeDef RCC_OscInitStruct = {0};
//USART_InitTypeDef USART_InitStructure;
//unsigned int InitTimer;
//int Status;

__HAL_RCC_PWR_CLK_ENABLE();
__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
	/////////////////////////////////////////////////////////////////////////////////////
	//Directly controlled GPIO setup
	/////////////////////////////////////////////////////////////////////////////////////
	GpioInitialSetup();
	WriteToGpioPin(LED_B,1);			//setup in progress

	WriteToGpioPin(LED_B,0);			//setup in progress

	//Initialise the Embedded Flash Interface, the PLL and update the SystemFrequency variable
	SystemInit();

	//System clock setup is done - read back for debug
//	RCC_GetClocksFreq(&RCC_ClocksNow); //System clock test function
	HAL_RCC_GetSysClockFreq();
	//System clock test results - external crystal  8 MHz:
	//SYSCLK = 67.199160 MHz
	//HCLK   = 67.199160 MHz
	//PCLK1  = 16.799790 MHz
	//PCKL2  = 33.599580 MHz

	/////////////////////////////////////////////////////////////////////////////////////
	//SysTick
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_HCLKConfig(RCC_SYSCLK_Div1); //setup AHB (HCLK) clock = SYSCLK
//	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK); //AHB clock selected as SysTick clock source
	//Initialises the RCC Oscillators according to the specified parameters in the RCC_OscInitTypeDef structure.
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	// Initialises the CPU, AHB and APB buses clocks

	RCC_ClocksNow.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
								 |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClocksNow.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
	RCC_ClocksNow.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClocksNow.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClocksNow.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClocksNow, FLASH_LATENCY_0) != HAL_OK)
	{
		Error_Handler();
	}


	SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk;

//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE); //enable clock for AFIO


	/////////////////////////////////////////////////////////////////////////////////////
	//Directly controlled GPIO setup
	/////////////////////////////////////////////////////////////////////////////////////
	GpioInitialSetup();


	/////////////////////////////////////////////////////////////////////////////////////
	//USART2 (Master commands) setup
	//further changes to be done via InitUsart() function
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE); //RCC enable for USART2
	__USART2_CLK_ENABLE();

//	InitUsart(USART2, 115200);
//	USART_Cmd(USART2, ENABLE);

//	huart2.Instance = USART2;
//	huart2.Init.BaudRate = 115200;
//	HAL_UART_Init(&huart2);
	Usart2GpioSetup(); //initialisation of associated GPIOs


	/////////////////////////////////////////////////////////////////////////////////////
	//USART3 (DUT) setup
	//further changes to be done via InitUsart() function
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE); //RCC enable for USART3
//	InitUsart(USART3, 115200);
//	USART_Cmd(USART3, ENABLE);
//	Usart3GpioSetup(); //initialisation of associated GPIOs


	/////////////////////////////////////////////////////////////////////////////////////
	//&UART4 (RDPs commands) setup
	//further changes to be done via InitUsart() function
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_&UART4,ENABLE); //RCC enable for &UART4
	__USART4_CLK_ENABLE();
//	InitUsart(&UART4, 9600);
//	InitUsart(&UART4, 57600);
//	USART_Cmd(&UART4, ENABLE);


//	huart4.Instance = &UART4;
//	huart4.Init.BaudRate = 57600;
//	HAL_UART_Init(&huart4);

