tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	Uart4GpioSetup(); //initialisation of associated GPIOs


	/////////////////////////////////////////////////////////////////////////////////////
	//&USART6 (ADAM commands) setup
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_&USART6,ENABLE); //RCC enable for &USART6
	__USART6_CLK_ENABLE();
//	InitUsart(&USART6, 115200);
//	USART_Cmd(&USART6, ENABLE);
//	huart6.Instance = &USART6;
//	huart6.Init.BaudRate = 115200;
//	HAL_UART_Init(&huart6);


	Usart6GpioSetup(); //initialisation of associated GPIOs


	/////////////////////////////////////////////////////////////////////////////////////
	//TIM2 (1ms IRQ) setup
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE); //TIM2 clock enable
//
//	//TIM2 time base configuration
//	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
//	TIM_TimeBaseStructure.TIM_Prescaler = 0;
////	TIM_TimeBaseStructure.TIM_Period = 26880; //f = 26880000 / 26880 = 1kHz -> 1ms period
//	TIM_TimeBaseStructure.TIM_Period = 26875;
//	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
//	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
//	TIM_ARRPreloadConfig(TIM2, ENABLE);
//	TIM_Cmd(TIM2, ENABLE); //TIM2 enable counter


	/////////////////////////////////////////////////////////////////////////////////////
	//TIM3 (Generator PWM out) setup
	/////////////////////////////////////////////////////////////////////////////////////
//    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE); //TIM3 clock enable
    __TIM3_CLK_ENABLE();
//    TIM_Cmd(TIM3, ENABLE); //TIM3 enable counter
    SetGeneratorOut(1000, 2688, 1344); //fout = 26880000 / 1000 / 2688 = 10Hz, 2688 / 1344 = 50% duty cycle
    Tim3GpioSetup();

	/////////////////////////////////////////////////////////////////////////////////////
	//TIM4 (GM pulses counting) setup
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE); //TIM4 clock enable
//	TIM_TIxExternalClockConfig(TIM4, TIM_TIxExternalCLK1Source_TI1, TIM_ICPolarity_Rising, 0x00);
//	TIM_Cmd(TIM4, ENABLE); //TIM4 enable counter
//    Tim4GpioSetup();

	/////////////////////////////////////////////////////////////////////////////////////
    //SPI1 (DUT to AD7794 interface test) setup
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE); //RCC enabled for SPI1
//	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
//	SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
////SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
//    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
//    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
//    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
//    SPI_InitStructure.SPI_NSS = SPI_NSS_Hard;
//    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16; //fclk = PCLK1/16 = 13.44 MHz/16 = 0.84MHz
//    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
//    SPI_InitStructure.SPI_CRCPolynomial = 7;
//    SPI_Init(SPI1, &SPI_InitStructure);
//    SPI_Cmd(SPI1, ENABLE);
//	Spi1GpioSetup();


    /////////////////////////////////////////////////////////////////////////////////////
    //SPI2 (DAC AD5060 interface) setup
	/////////////////////////////////////////////////////////////////////////////////////
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE); //RCC enabled for SPI2
//	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
//    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
//    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
//    SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
//    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
//    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
//    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32; //fclk = PCLK1/32 = 13.44 MHz/32 = 0.42MHz
//    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
//    SPI_InitStructure.SPI_CRCPolynomial = 7;
//    SPI_Init(SPI2, &SPI_InitStructure);
//    SPI_Cmd(SPI2, ENABLE);
//	Spi2GpioSetup();


	/////////////////////////////////////////////////////////////////////////////////////
	//I2C1 setup - used for HYT and IRT communication
	/////////////////////////////////////////////////////////////////////////////////////
//    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);//I2C Periph clock enable
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE); // GPIO Periph clock enable
//    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
//    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
//    I2C_InitStructure.I2C_OwnAddress1 = 0xA0;
//    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
//    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
//    I2C_InitStructure.I2C_ClockSpeed = 100000;
//    I2C_Init(I2C1, &I2C_InitStructure);// Apply I2C configuration after enabling it
//    I2C_Cmd(I2C1, ENABLE); //I2C Peripheral Enable
//    I2c1GpioSetup(); //initialisation of associated GPIOs

	/////////////////////////////////////////////////////////////////////////////////////
	//Interrupt system setup
	/////////////////////////////////////////////////////////////////////////////////////
//	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_0); //Configure the NVIC Preemption Priority Bits
    HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_0); //Configure the NVIC Preemption Priority Bits

	//USART2 IRQ setup
#ifdef MASTER_CMD_USART2

    HAL_NVIC_SetPriority(USART2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);

//	NVIC_InitStruct.NVIC_IRQChannel = USART2_IRQn;
//	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
//	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;

//	NVIC_Init(&NVIC_InitStruct);
//	USART_ITConfig(USART2, UART_IT_RXNE, ENABLE);
//	__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE );
#endif

	//&USART6 IRQ setup
#ifdef MASTER_CMD_&USART6
    HAL_NVIC_SetPriority(&USART6_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(&USART6_IRQn);

//	NVIC_InitStruct.NVIC_IRQChannel = &USART6_IRQn;
//	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
//	NVIC_InitStruct.NVIC_IRQCh annelCmd = ENABLE;
//	NVIC_Init(&NVIC_InitStruct);
//	USART_ITConfig(&USART6, UART_IT_RXNE, ENABLE);
#endif

