tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	//TIM2 IRQ setup
//	NVIC_InitStruct.NVIC_IRQChannel = TIM2_IRQn;
//	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 1;
//	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
//	NVIC_Init(&NVIC_InitStruct);
//	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);


	/////////////////////////////////////////////////////////////////////////////////////
	//Initialisation of global variables
	/////////////////////////////////////////////////////////////////////////////////////
	ModuleMode = MM_STANDBY;			//current module mode = standby
	CmdReceived = 0;					//no command is ready for decoding
	CmdCounter = 0;						//command counter - number of received bytes = 0
	CmdDecoded = CMD_NONE;				//no command is decoded and to be executed
	SB = 0;								//Status Byte - no error
	MT = 0x14;							//Module Type RADM
	MA = 0x00;							//Module Address
	Sample = 0;							//sample counter - timestamp for measurement
	SamplePacketCount = 0;				//sample packet counter - counts measurements per packet
	RdpAddresses[RDP_THRUST] = 0x00;	//RDP meters RS-485 addresses - thrust meter
	RdpAddresses[RDP_TORQUE] = 0x00;	//RDP meters RS-485 addresses - torque meter
	WriteToGpioPin(LED_B,0);			//setup done

	/////////////////////////////////////////////////////////////////////////////////////
	//welcome alarm
	/////////////////////////////////////////////////////////////////////////////////////
	WriteToGpioPin(ALARM, 1);
	Sleep(50);
	WriteToGpioPin(ALARM, 0);


	/////////////////////////////////////////////////////////////////////////////////////
	//initial self-test
	/////////////////////////////////////////////////////////////////////////////////////
	Sleep(50000); //sleep 5s for ADAM to boot-up
	RadmSelfTest(0); //RPDs not tested at this stage


	/////////////////////////////////////////////////////////////////////////////////////
	//Debug function - TODO to be commented out in the final version!
	/////////////////////////////////////////////////////////////////////////////////////
	DebugTestFunc();

}
//*--------------------------------------------------------------------------------------
//* Function Name         : DebugOnlyFunc
//* Object                : This function is to be used for initial debugging only!
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void DebugTestFunc(void)
{
////unsigned char RelayBuffer[12];
//int Loop;
//unsigned char CmdPacket[10];
//int Status;
////unsigned char DataByte;
//unsigned char AdamDataPacket[50];
//unsigned char APS;
//double MeasVolt;
//double MeasVal;

//ModuleMode = MM_MEAS_INIT;
//Sample = 0x12345678;
//MeasuredThrust = 3541423.354;
//MeasuredTorque = 53.46541;;
//MeasuredCurrent = 12.6983;
//ActualAps = 0x55;

//here
//////Status = AdamReadAdc(&MeasVolt);
//////Status++;


//test = atof("-12.3");
//test++;
//
//double *PointerDouble;
//unsigned char *PointerBytes;
//double DoubleValues[4];
//
//
////data packet
//DoubleValues[0] = MeasTempDut;
//DoubleValues[1] = MeasTempAmbient;
//DoubleValues[1] = MovingAverTempAmbient;
//DoubleValues[2] = SetDutTemp;
//DoubleValues[3] = HeaterPower;
//for(DoubleLoop = 0; DoubleLoop < 4; DoubleLoop++)
//{
//	PointerDouble = &DoubleValues[DoubleLoop];
//	PointerBytes = (unsigned char *)PointerDouble;
//	for(Loop = 0; Loop < 8; Loop++)
//	{
//		ResponsePacket[Loop + (DoubleLoop * 8)] = *PointerBytes;
//		PointerBytes++;
//	}
//}
//
//SendResponseToMaster(ResponsePacket, 32);






//int ReceiveUsartPacket(UART_HandleTypeDef USARTx, unsigned char *DataPacket, unsigned int PacketLength, unsigned int TimeOut)

////synchronised sampling CMD
//CmdPacket[0] = '#';
//CmdPacket[1] = '*';
//CmdPacket[2] = '*';
//AdamSendCommand(&USART6, CmdPacket, 3);


//while(ReadGpioPinStatus(TEST_PIN) == 1);
//while(ReadGpioPinStatus(TEST_PIN) == 0);



//while(2)
//{
//	while(ReadGpioPinStatus(CLK_SYN) == 0);
//	while(ReadGpioPinStatus(CLK_SYN) == 1);
//	ToggleGpioPin(TEST_PIN);

	//synchronised sampling CMD
//	CmdPacket[0] = '#';
//	CmdPacket[1] = '*';
//	CmdPacket[2] = '*';
//	AdamSendCommand(&USART6, CmdPacket, 3);
//
//	Sleep(800);
//

//	CmdPacket[0] = '#';
//	CmdPacket[1] = '0';
//	CmdPacket[2] = '1';
//	CmdPacket[3] = ' ';
//	CmdPacket[4] = 'S';
//	CmdPacket[5] = 'C';
//	CmdPacket[6] = 'A';
//	CmdPacket[7] = 'N';
//	CmdPacket[8] = '\r';
//	CmdPacket[9] = '\n';
//
//
//	WriteToGpioPin(RS485_DIR2,1);
//	USART_ClearFlag(&UART4, USART_FLAG_TC);
//	for(Loop = 0; Loop < 10; Loop++)
//	{
//		USART_SendData(&UART4,CmdPacket[Loop] & 0x1FF);
//		while (USART_GetFlagStatus(&UART4, USART_FLAG_TC) == RESET);
//	}
//	WriteToGpioPin(RS485_DIR2,0);
//
//	//get data
//	Status = ReceiveUsartPacket(&UART4, AdamDataPacket, 9, 10000);
//	Status = RdpReadVal(0x01, &MeasVal);
//Status = 10;
//
//Status = RdpReadVal(0x02, &MeasVal);
//Status = 10;
	//read synchronised data CMD
//	CmdPacket[0] = '#';
//	CmdPacket[1] = '0';
//	CmdPacket[2] = '1';
//	CmdPacket[3] = '4';
//	AdamSendCommand(&USART6, CmdPacket, 3);
//
//	//get data
//	ReceiveUsartPacket(&USART6, AdamDataPacket, 11, 10000);
//
//
//	USART_ClearFlag(USART2, USART_FLAG_TC);
//	for(Loop = 0; Loop < 7; Loop++)
//	{
//		USART_SendData(USART2,AdamDataPacket[Loop+1] & 0x1FF);
//		while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
//	}
//
//	USART_SendData(USART2,'\n' & 0x1FF);
//	while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);


//	//synchronised sampling CMD
//	CmdPacket[0] = '#';
//	CmdPacket[1] = '*';
//	CmdPacket[2] = '*';
//	AdamSendCommand(&USART6, CmdPacket, 3);

//}

//	while(2)
//	{
////		WriteToGpioPin(PLED_R, 0);
////		WriteToGpioPin(PLED_G, 1);
////		WriteToGpioPin(PLED_G, 0);
////		WriteToGpioPin(PLED_R, 1);
////		APS = ReadAsp();
////		APS = 0;
//
////		WriteToGpioPin(PLED_G, ReadGpioPinStatus(CLK_SYN));
//		WriteToGpioPin(USART2_CTS, ReadGpioPinStatus(USART2_RTS));
//		WriteToGpioPin(PLED_R, ReadGpioPinStatus(USART2_RTS));
//	}
//
//
}
//*--------------------------------------------------------------------------------------
//* Function Name         : Sleep 
//* Object                : Sleep for defined time, to be used for delay longer than 0.1ms
//*                         This delay function is based on SysTick timer - resolution is 100us
//*
//* Input Parameters      : unsigned int HundMicroSec - range 0.1ms to 4294967.296s
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void Sleep(unsigned int HundMicroSec)
{
unsigned int Loop;

