tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	return(CrcTable[(OldCrc ^ DataByte)]);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : SendResponseToMaster
//* Object                : Send module response packet including CRC, no header nor end 
//*							character to be sent
//*
//* Input Parameters      : unsigned char *DataPacket - pointer to input data array
//*							unsigned int Length - total length of input data array
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void SendResponseToMaster(unsigned char *DataPacket, unsigned int Length)
{
unsigned int Loop;
unsigned char CrcByte;

#ifdef MASTER_CMD_USART2
	CrcByte = CRC_INIT;
	//send data
	__HAL_UART_CLEAR_FLAG(&huart2,UART_FLAG_TC);
//	USART_ClearITPendingBit(USART2, UART_FLAG_TC);
	for(Loop = 0; Loop < Length; Loop++)
	{
//		USART_SendData(USART2,DataPacket[Loop] & 0x1FF);
		HAL_UART_Transmit(&huart2, DataPacket[Loop] & 0x1FF, sizeof(DataPacket[Loop] & 0x1FF), HAL_MAX_DELAY);
//		while(USART_GetITStatus(USART2,UART_IT_TC) == RESET );
		while(__HAL_UART_GET_FLAG(&huart2,UART_FLAG_TC) == RESET);
		CrcByte = Get8BitCrc(DataPacket[Loop], CrcByte);
	}
	//send CRC
//	USART_SendData(USART2,CrcByte & 0x1FF);
	HAL_UART_Transmit(&huart2, CrcByte & 0x1FF, sizeof(CrcByte & 0x1FF), HAL_MAX_DELAY);
//	while (USART_GetFlagStatus(USART2, UART_FLAG_TC) == RESET);
	while(__HAL_UART_GET_FLAG(&huart2,UART_FLAG_TC) == RESET);

#endif

#ifdef MASTER_CMD_&USART6
//	CrcByte = CRC_INIT;
//	//send data
//	USART_ClearFlag(&USART6, USART_FLAG_TC);
//	for(Loop = 0; Loop < Length; Loop++)
//	{
//		USART_SendData(&USART6,DataPacket[Loop] & 0x1FF);
//		while (USART_GetFlagStatus(&USART6, USART_FLAG_TC) == RESET);
//		CrcByte = Get8BitCrc(DataPacket[Loop], CrcByte);
//	}
//	//send CRC
//	USART_SendData(&USART6,CrcByte & 0x1FF);
//	while (USART_GetFlagStatus(&USART6, USART_FLAG_TC) == RESET);
#endif
}
//*--------------------------------------------------------------------------------------
//* Function Name         : DecodeCmd
//* Object                : Decode master (PC) command
//*
//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void DecodeCmd(void)
{
unsigned char CrcByte;
unsigned char Loop;

//Command characters table - the higher position the faster response
unsigned char CmdChars[CMD_LAST - 1][2] =
{
	{'P',	'G'},	//Ping module
	{'M',	'S'},	//CMD Start measurement
	{'M',	'E'},	//CMD End measurement
	{'S',	'T'},	//CMD Self-test
	{'R',	'S'},	//CMD RADM setup
	{'A',	'C'}	//CMD alarm control
};

	//until decoded, no cmd received
	CmdDecoded = CMD_NONE;

	//double check the package length
	if(CmdCounter != (CmdPacket[3] + 6))
		return;

	//double check the package header
	if(CmdPacket[0] != '!')
		return;

	//double check the module type
	if(CmdPacket[1] != MT)
		return;

	//double check the module address
	if(CmdPacket[2] != MA)
		return;

	//compare command characters
	for(Loop = 0; Loop < (CMD_LAST - 1); Loop++)
	{
		if((CmdPacket[4] == CmdChars[Loop][0]) && (CmdPacket[5] == CmdChars[Loop][1]))
		{
			CmdDecoded = Loop + 1;
			break;
		}
	}

	//Check packet checksum
	CrcByte = CRC_INIT;
	for(Loop = 1;Loop < (CmdCounter - 2); Loop++) //header is not a part of checksum check
		CrcByte = Get8BitCrc(CmdPacket[Loop], CrcByte);

	if(CmdPacket[CmdCounter - 2] != CrcByte)
	{
		CmdDecoded = CMD_NONE;
		return;
	}

	//Packet ending char check
	if(CmdPacket[CmdCounter - 1] != '#')
	{
		CmdDecoded = CMD_NONE;
		return;
	}
}
//*--------------------------------------------------------------------------------------
//* Function Name         : SendSlaveCmd
//* Object                : Send Uart command to a slave module
//*
//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned char SMT - Slave Module Type
//*							unsigned char SMA - Slave Module Address
//*							unsigned int Cmd - enum SLAVE_COMMANDS
//*							unsigned char *DataPacket - pointer to input packet of parameters
//*							unsigned int PacketSize - length of input packet of parameters
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void SendSlaveCmd(UART_HandleTypeDef USARTx, unsigned char SMT, unsigned char SMA, unsigned int Cmd, unsigned char *DataPacket, unsigned int PacketSize)
{
unsigned char CrcByte;
unsigned char Loop;
unsigned char CmdBuffer[CMD_PACK_MAX];
unsigned char CmdData[SCMD_LAST][2] =
{
	{'P',	'G'},		//Ping module
	{'W',	'R'},		//RDM Write to all relay driver data registers
	{'S',	'T'}		//RadEx SPI single byte test
};

	//Header
	CmdBuffer[0] = '!';

	//Module Type
	CmdBuffer[1] = SMT;

	//Module Address
	CmdBuffer[2] = SMA;

	//Size of CMD
	CmdBuffer[3] = 0x02 + PacketSize;

	//CMD char 1
	CmdBuffer[4] = CmdData[Cmd][0];

	//CMD char 2
	CmdBuffer[5] = CmdData[Cmd][1];

	//CMD data
	for(Loop = 0; Loop < PacketSize; Loop++)
	{
		CmdBuffer[Loop + 6] = DataPacket[Loop];
	}

	//Generate packet checksum
	CrcByte = CRC_INIT;
	for(Loop = 1;Loop < (PacketSize + 6); Loop++) //header is not a part of checksum check
		CrcByte = Get8BitCrc(CmdBuffer[Loop], CrcByte);

	CmdBuffer[PacketSize + 6] = CrcByte;

	//Package end character
	CmdBuffer[PacketSize + 7] = '#';

	//Send data
	USART_ClearFlag(USARTx, UART_FLAG_TC);
	for(Loop = 0; Loop < (PacketSize + 8); Loop++)
	{
		USART_SendData(USARTx,CmdBuffer[Loop] & 0x1FF);
//		while (USART_GetFlagStatus(USARTx, UART_FLAG_TC) == RESET);
		while(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_TC) == RESET);
	}

}
//*--------------------------------------------------------------------------------------
//* Function Name         : ReceiveUsartPacket
//* Object                : Receives USART Packet or timeout
//*
//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned char *DataPacket - pointer to data packet
//*							unsigned int PacketLength - length packet to be received
//*							unsigned int TimeOut - number of 10us waiting periods to give up
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int ReceiveUsartPacket(UART_HandleTypeDef USARTx, unsigned char *DataPacket, unsigned int PacketLength, unsigned int TimeOut)
{
unsigned int Sleep10UsCounter;
unsigned int Loop;

	for(Loop = 0; Loop < PacketLength; Loop++)
	{
		/*waiting for byte on USART or timeout  */
		Sleep10UsCounter  = 0;
//		while(USART_GetFlagStatus(USARTx, UART_FLAG_RXNE) == RESET)
		while(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_TC) == RESET)
		{
			Sleep10us(1);
			Sleep10UsCounter++;
			if(Sleep10UsCounter >= TimeOut)
				break;
		}

//		if(USART_GetFlagStatus(USARTx, UART_FLAG_RXNE) == SET)
		if(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_RXNE) == SET)
			DataPacket[Loop] =( unsigned char)USART_ReceiveData(USARTx); //byte received
		else
			return(-1);	//timeout error
	}

	return(0); //OK
}
//*--------------------------------------------------------------------------------------
//* Function Name         : ReceiveUsartPacketCrtCheck
//* Object                : Receives USART Packet (or timeout) and performs CRT check
//*
//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned char *DataPacket - pointer to data packet
//*							unsigned int PacketLength - length packet to be received (including CRT)
//*							unsigned int TimeOut - number of 10us waiting periods to give up
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int ReceiveUsartPacketCrtCheck(UART_HandleTypeDef USARTx, unsigned char *DataPacket, unsigned int PacketLength, unsigned int TimeOut)
{
unsigned int Sleep10UsCounter;
unsigned int Loop;
unsigned char CrcByte;

	//receive data packet
	for(Loop = 0; Loop < PacketLength; Loop++)
	{
		//waiting for byte on USART or timeout
		Sleep10UsCounter  = 0;
//		while(USART_GetFlagStatus(&USARTx, UART_FLAG_RXNE) == RESET)
		while(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_RXNE) == RESET)
		{
			Sleep10us(1);
			Sleep10UsCounter++;
			if(Sleep10UsCounter >= TimeOut)
				break;
		}

//		if(USART_GetFlagStatus(&USARTx, UART_FLAG_RXNE) == SET)
		if(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_RXNE) == SET)
			DataPacket[Loop] =( unsigned char)USART_ReceiveData(USARTx); //byte received
		else
			return(-1);	//timeout error
	}

