tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	//check data packet for CRT
	CrcByte = CRC_INIT;
	for(Loop = 0;Loop < (PacketLength - 1); Loop++)
		CrcByte = Get8BitCrc(DataPacket[Loop], CrcByte);

	if(DataPacket[PacketLength - 1] != CrcByte)
		return(-2);	//CRC error

	return(0); //OK
}
//*--------------------------------------------------------------------------------------
//* Function Name         : SetGeneratorOut
//* Object                : Set generator (TIM3) square output
//*
//* Input Parameters      : uint16_t Prescaler - Counter prescaler (1 = no division)
//*							uint16_t Period - pulse period (2 to 65535)
//*							uint16_t Pulse - Clock pulse width (1 to 65535)
//*							fout = CLK/Prescaler/Period
//*							pulse width = Period/Pulse
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------


void SetGeneratorOut(uint16_t Prescaler, uint16_t Period, uint16_t Pulse)
{
//TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_ClockConfigTypeDef sClockSourceConfig;
TIM_MasterConfigTypeDef TIM_TimeBaseStructure;
TIM_OC_InitTypeDef  TIM_OCInitStructure;

	//Time base configuration
//	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
//	TIM_TimeBaseStructure.TIM_Prescaler = Prescaler - 1;
//	TIM_TimeBaseStructure.TIM_Period = Period - 1;
//	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
//	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	htim3.Instance = TIM3;
	htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	htim3.Init.Prescaler = Prescaler -1; // defined in function para
	htim3.Init.Period = Period  -1;
	htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
	if (HAL_TIM_Base_Init(&htim3) != HAL_OK)
	{
	Error_Handler();
	}
	sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
	if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK)
	{
	Error_Handler();
	}
	TIM_TimeBaseStructure.MasterOutputTrigger = TIM_TRGO_RESET;
	TIM_TimeBaseStructure.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
	if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &TIM_TimeBaseStructure) != HAL_OK)
	{
	Error_Handler();
	}
	HAL_TIM_Base_Start(&htim3);
	HAL_TIM_PWM_Init(&htim3);

	//PWM1 Mode configuration: Channel3
//	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
//	TIM_OCInitStructure.TIM_Pulse = Pulse;
//	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
//	TIM_OC3Init(TIM3, &TIM_OCInitStructure);
//
//	TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Enable);
//	TIM_ARRPreloadConfig(TIM3, ENABLE);

	TIM_OCInitStructure.OCMode = TIM_OCMODE_PWM1;
	TIM_OCInitStructure.Pulse = Pulse;
	TIM_OCInitStructure.OCPolarity = TIM_OCPOLARITY_HIGH;
	TIM_OCInitStructure.OCFastMode = TIM_OCFAST_DISABLE;
	HAL_TIM_PWM_ConfigChannel(&htim3, &TIM_OCInitStructure, TIM_CHANNEL_3);

	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3); //STARt PWM generation
}
//*--------------------------------------------------------------------------------------
//* Function Name         : SetSpiChipEnable
//* Object                : Enable/disable SPI slave device
//*
//* Input Parameters      : int SpiDevice - device to control (enum SPI_DEVICES)
//*							int NewState - state to be used
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

//void SetSpiChipEnable(int SpiDevice, int NewState)
//{
//
//	switch(SpiDevice)
//	{
//		case SPI_DEV_ADS1211:
//		if(NewState == 1)
//			WriteToGpioPin(ADC_CS,0); //Chip enabled
//
//		if(NewState == 0)
//			WriteToGpioPin(ADC_CS,1); //Chip enabled
//		break;
//		//*******************************************************************************
//	}
//}
//*--------------------------------------------------------------------------------------
//* Function Name         : InitUart4
//* Object                : Initial settings of USART, can be used to change BaudRate
//*							This way is used as there no way to read back USART settings
//*
//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned int BaudRate - BaudRate to be selected (9600 = 9600Bd)
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void InitUsart(UART_HandleTypeDef USARTx, unsigned int BaudRate)
{
//USART_InitTypeDef USART_InitStructure;
//
//	USART_InitStructure.USART_BaudRate = BaudRate;
//	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
//	USART_InitStructure.USART_StopBits = USART_StopBits_1;
//	USART_InitStructure.USART_Parity = USART_Parity_No;
//	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
//	USART_Init(USARTx, &USART_InitStructure);


UART_HandleTypeDef huart;

	huart.Instance = &USARTx;
	huart.Init.BaudRate = BaudRate;
	huart.Init.WordLength = UART_WORDLENGTH_8B;
	huart.Init.StopBits = UART_STOPBITS_1;
	huart.Init.Parity = UART_PARITY_NONE;
	huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart.Init.Mode = UART_MODE_TX_RX;
	if (HAL_UART_Init(&huart) != HAL_OK)
	{
		Error_Handler();
	}

	//clear flags
//	USART_ClearFlag(&USARTx, UART_FLAG_RXNE);
//	USART_ClearFlag(&USARTx, UART_FLAG_TXE);
//	USART_ClearFlag(&USARTx, UART_FLAG_TC);
	__HAL_UART_CLEAR_FLAG(&USARTx,UART_FLAG_RXNE);
	__HAL_UART_CLEAR_FLAG(&USARTx,UART_FLAG_TXE);
	__HAL_UART_CLEAR_FLAG(&USARTx,UART_FLAG_TC);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : ReadAsp
//* Object                : Read Actuator position switch inputs
//*
//* Input Parameters      : none
//* Output Parameters     : unsigned char switches - actual status of ASPs
//*--------------------------------------------------------------------------------------

unsigned char ReadAsp(void)
{
unsigned int Loop;
unsigned char Mask;
unsigned char APS;

	Mask = 0x01;
	APS = 0x00;
	for(Loop = 0; Loop < NR_ACT_PS; Loop++)
	{
		if(ReadGpioPinStatus(ActuatorPosSwitches[Loop]) == 1)
			APS &= ~Mask;
		else
			APS |= Mask;
		Mask <<= 1;
	}
	return(APS);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : AdamSendCommand
//* Object                : Send command to ADAM, including the checksum
//*
//* Input Parameters      : none

//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned char *CmdPacket - pointer to command packet (excluding checksum and end char)
//*							unsigned int CmdSize - length of the command packet (excluding checksum and end char)
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void AdamSendCommand(UART_HandleTypeDef USARTx, unsigned char *CmdPacket, unsigned int CmdSize)
{
unsigned int Loop;
unsigned char CheckSum;
unsigned char CheckSumLowChar;
unsigned char CheckSumHighChar;

	//switch to TX mode
	WriteToGpioPin(RS485_DIR1, 1);

