tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	//send the CMD packet
	CheckSum = 0;
//	USART_ClearFlag(USARTx, UART_FLAG_TC);
	__HAL_UART_CLEAR_FLAG(&USARTx,UART_FLAG_TC);
	for(Loop = 0; Loop < CmdSize; Loop++)
	{
		USART_SendData(USARTx,CmdPacket[Loop] & 0x1FF);
//		while (USART_GetFlagStatus(USARTx, UART_FLAG_TC) == RESET);
		while(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_TC) == RESET);
		CheckSum += CmdPacket[Loop];
	}

	//calculate the CheckSum
	CheckSum %= 0x100;
	CheckSumHighChar = CheckSum;
	CheckSumHighChar >>= 4;
	if(CheckSumHighChar < 10)
		CheckSumHighChar += 0x30;
	else
		CheckSumHighChar += 0x37;

	CheckSumLowChar = CheckSum;
	CheckSumLowChar &= 0x0F;
	if(CheckSumLowChar < 10)
		CheckSumLowChar += 0x30;
	else
		CheckSumLowChar += 0x37;

	//send the CheckSum
	USART_SendData(USARTx,CheckSumHighChar & 0x1FF);
	while (USART_GetFlagStatus(USARTx, UART_FLAG_TC) == RESET);
	USART_SendData(USARTx,CheckSumLowChar & 0x1FF);
	while (USART_GetFlagStatus(USARTx, UART_FLAG_TC) == RESET);

	//send the end char
	USART_SendData(USARTx,0x0D);
	while (USART_GetFlagStatus(USARTx, UART_FLAG_TC) == RESET);

	//switch back to RX mode
	WriteToGpioPin(RS485_DIR1, 0);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : AdamReceiveDataCrtCheck
//* Object                : Receives USART Packet (or timeout) and performs CRT check
//*
//* Input Parameters      : UART_HandleTypeDef USARTx -  where x can be 1, 2, 3, 4, 5 or 6 to select the USART or UART
//*							unsigned char *DataPacket - pointer to data packet
//*							unsigned int PacketLength - length of packet to be received (including CRT and end char)
//*							unsigned int TimeOut - number of 10us waiting periods to give up
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int AdamReceiveDataCrtCheck(UART_HandleTypeDef USARTx, unsigned char *DataPacket, unsigned int PacketLength, unsigned int TimeOut)
{
unsigned int Sleep10UsCounter;
unsigned int Loop;
unsigned char CheckSum;
unsigned char CheckSumLowChar;
unsigned char CheckSumHighChar;

	//receive data packet
	CheckSum = 0;
	for(Loop = 0; Loop < PacketLength; Loop++)
	{
		//waiting for byte on USART or timeout
		Sleep10UsCounter  = 0;
//		while(USART_GetFlagStatus(USARTx, UART_FLAG_RXNE) == RESET)
		while(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_RXNE) == RESET)
		{
			Sleep10us(1);
			Sleep10UsCounter++;
			if(Sleep10UsCounter >= TimeOut)
				break;
		}

//		if(USART_GetFlagStatus(USARTx, UART_FLAG_RXNE) == SET)
		if(__HAL_UART_GET_FLAG(&USARTx,UART_FLAG_RXNE) == SET)
			DataPacket[Loop] =( unsigned char)USART_ReceiveData(USARTx); //byte received
		else
			return(-1);	//timeout error

		if(Loop < (PacketLength - 3))
			CheckSum += DataPacket[Loop];
	}

	//calculate the CheckSum
	CheckSum %= 0x100;
	CheckSumHighChar = CheckSum;
	CheckSumHighChar >>= 4;
	if(CheckSumHighChar < 10)
		CheckSumHighChar += 0x30;
	else
		CheckSumHighChar += 0x37;

	CheckSumLowChar = CheckSum;
	CheckSumLowChar &= 0x0F;
	if(CheckSumLowChar < 10)
		CheckSumLowChar += 0x30;
	else
		CheckSumLowChar += 0x37;


	//check data packet for CheckSum
	if((DataPacket[PacketLength - 3] != CheckSumHighChar)||(DataPacket[PacketLength - 2] != CheckSumLowChar))
		return(-2); //CheckSum error

	//check data packet for end char
	if(DataPacket[PacketLength - 1] != '\r')
		return(-3); //end char error

	return(0); //OK
}
//*--------------------------------------------------------------------------------------
//* Function Name         : RadmSelfTest
//* Object                : Self test of module, result stored in SB (SB_OK_ macros)
//* Input Parameters      : none

//* Input Parameters      : int TestRdps - RDP test enabled [1 = yes, 0 = no]
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void RadmSelfTest(int TestRdps)
{
unsigned int Timeout;
unsigned int FirstEdge;
unsigned char CmdPacket[10];
int Status;
unsigned char AdamDataPacket[15];
unsigned char AdamTestPacket[7] = {"!014012"};
unsigned int Loop;



	//initial SB = all OK
	SB = 0x00;

	/////////////////////////////////////////////////////////////////
	//test synchronisation clock
	/////////////////////////////////////////////////////////////////
	//1. waiting for the edge
	Timeout = 0;
	if(ReadGpioPinStatus(CLK_SYN) == 0)
	{
		FirstEdge = 0;
		while(ReadGpioPinStatus(CLK_SYN) == 0)
		{
			Sleep10us(1);
			Timeout++;

			if(Timeout > 10000)
				break;
		}
	}
	else
	{
		FirstEdge = 1;
		while(ReadGpioPinStatus(CLK_SYN) == 1)
		{
			Sleep10us(1);
			Timeout++;

			if(Timeout > 10000)
				break;
		}

	}

	//2. some edge appeared - measure the time until the another (the same) one appears
	if(Timeout < 10000)
	{
		Timeout = 0;
		if(FirstEdge == 0)
		{
			//waiting for rising edge
			while(ReadGpioPinStatus(CLK_SYN) == 1)
			{
				Sleep(1);
				Timeout++;
			}
			while(ReadGpioPinStatus(CLK_SYN) == 0)
			{
				Sleep(1);
				Timeout++;
			}
		}
		else
		{
			//waiting for falling edge
			while(ReadGpioPinStatus(CLK_SYN) == 0)
			{
				Sleep(1);
				Timeout++;
			}
			while(ReadGpioPinStatus(CLK_SYN) == 1)
			{
				Sleep(1);
				Timeout++;
			}
		}

		//check the timeout within 10% limits (nominal value is 972)
		if((Timeout > 845) && (Timeout < 1069))
			SB &= SB_OK_CLK_SYNC; //OK
		else
			SB |= ~SB_OK_CLK_SYNC; //error
	}
	else
	{
		SB |= ~SB_OK_CLK_SYNC; //error
	}


	/////////////////////////////////////////////////////////////////
	//test the presence of the ADAM module
	/////////////////////////////////////////////////////////////////
	//Read Module Name command
	CmdPacket[0] = '$';
	CmdPacket[1] = '0';
	CmdPacket[2] = '1';
	CmdPacket[3] = 'M';
	HAL_UART_Transmit(&huart6, CmdPacket, sizeof(CmdPacket), HAL_MAX_DELAY);
//	AdamSendCommand(&USART6, CmdPacket, 4);

	//get data
	Status = HAL_UART_Receive(&huart6, AdamDataPacket, sizeof(AdamDataPacket), HAL_MAX_DELAY);
//	Status = AdamReceiveDataCrtCheck(&USART6, AdamDataPacket, 10, 10000);

