tzhen1/STM32/TempSensor/Core/Src/RADM_system.c
	//test data
	SB |= ~SB_OK_ADAM; //error
	if(Status == 0)
	{
		for(Loop = 0;Loop < 7;Loop++)
		{
			if(AdamTestPacket[Loop] !=	AdamDataPacket[Loop])
				break;
		}
		if(Loop == 7)
			SB &= SB_OK_ADAM; //OK
	}


	/////////////////////////////////////////////////////////////////
	//test the presence of the RDP meters
	/////////////////////////////////////////////////////////////////
	if(TestRdps == 1)
	{
		//test top RDP - thrust
		Status = RdpTest(RdpAddresses[RDP_THRUST]);
		if(Status)
			SB |= ~SB_OK_RDP_THRUST; //error
		else
			SB &= SB_OK_RDP_THRUST; //OK

		Sleep(10); //sleep 1ms to avoid bus collisions

		//test bottom RDP - torque
		Status = RdpTest(RdpAddresses[RDP_TORQUE]);
		if(Status)
			SB |= ~SB_OK_RDP_TORQUE; //error
		else
			SB &= SB_OK_RDP_TORQUE; //OK
	}


	SB = SB; //for debug only

}
//*--------------------------------------------------------------------------------------
//* Function Name         : SendMeasurementResults
//* Object                : Send measurements results (global variables) to the master
//* Input Parameters      : none

//* Input Parameters      : none
//* Output Parameters     : none
//*--------------------------------------------------------------------------------------

void SendMeasurementResults(void)
{
double *PointerDouble;
unsigned char *PointerBytes;
double DoubleValues[3];
unsigned char ResponsePacket[30*RADM_DATA_PACK];
unsigned int SampleCopy;
unsigned int Loop;
unsigned int MeasLoop;
unsigned int DoubleLoop;


	//multiple measurements per packet
	for(MeasLoop = 0; MeasLoop < RADM_DATA_PACK; MeasLoop++)
	{
		//create response data packet: sample
		SampleCopy = SampleArray[MeasLoop];
		for(Loop = 4; Loop > 0; Loop--)
		{
			ResponsePacket[(Loop - 1)+(29 * MeasLoop)] = (unsigned char)(SampleCopy & 0x000000FF);
			SampleCopy >>= 8;
		}

		//create response data packet: APS
		ResponsePacket[4+(29 * MeasLoop)] = ActualAps[MeasLoop];

		//create response data packet: double values
		DoubleValues[0] = MeasuredThrust[MeasLoop];
		DoubleValues[1] = MeasuredTorque[MeasLoop];
		DoubleValues[2] = MeasuredCurrent[MeasLoop];

		for(DoubleLoop = 0; DoubleLoop < 3; DoubleLoop++)
		{
			PointerDouble = &DoubleValues[DoubleLoop];
			PointerBytes = (unsigned char *)PointerDouble;
			for(Loop = 0; Loop < 8; Loop++)
			{
				ResponsePacket[Loop + (DoubleLoop * 8) + 5 + (29 * MeasLoop)] = *PointerBytes;
				PointerBytes++;
			}
		}
	}

	SendResponseToMaster(ResponsePacket, (29*RADM_DATA_PACK));

}
//*--------------------------------------------------------------------------------------
//* Function Name         : AdamReadInput
//* Object                : Reads input value from ADAM using Analog Data In command
//*
//* Input Parameters      : double *MeasVolt - pointer to the result
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int AdamReadAdc(double *MeasVolt)
{
unsigned char CmdPacket[10];
int Status;
unsigned char AdamDataPacket[15];
unsigned int Loop;
char NumberStr[10];


	//Analog Data In command
	CmdPacket[0] = '#';
	CmdPacket[1] = '0';
	CmdPacket[2] = '1';
//	AdamSendCommand(&USART6, CmdPacket, 3);
	HAL_UART_Transmit(&huart6, CmdPacket, sizeof(CmdPacket), HAL_MAX_DELAY);

	//get data

//	Status = AdamReceiveDataCrtCheck(&USART6, AdamDataPacket, 11, 10000);
	Status = HAL_UART_Receive(&huart6, AdamDataPacket, sizeof(AdamDataPacket), HAL_MAX_DELAY);
	if(Status)
		return(-1);

	//data OK, time to parse the value
	for(Loop = 0; Loop < sizeof(NumberStr); Loop++)
		NumberStr[Loop] = 0x00;
	for(Loop = 0; Loop < 7; Loop++)
		NumberStr[Loop] = (char)AdamDataPacket[Loop + 1];
	*MeasVolt = atof(NumberStr);

	return(0);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : RdpReadVal
//* Object                : Reads display value from RDP using SCAN command
//*
//* Input Parameters      : unsigned char RdpAddress - RS485 address
//*							double *MeasVal - pointer to the result
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int RdpReadVal(unsigned char RdpAddress, double *MeasVal)
{
unsigned char CmdPacket[10];
int Status;
unsigned char RdpDataPacket[10];
unsigned int Loop;
char NumberStr[10];
char AddressHighChar;
char AddressLowChar;

	//get the address characters
	AddressHighChar = RdpAddress;
	AddressHighChar >>= 4;
	if(AddressHighChar < 10)
		AddressHighChar += 0x30;
	else
		AddressHighChar += 0x37;

	AddressLowChar = RdpAddress;
	AddressLowChar &= 0x0F;
	if(AddressLowChar < 10)
		AddressLowChar += 0x30;
	else
		AddressLowChar += 0x37;

	//prepare the command string
	CmdPacket[0] = '#';
	CmdPacket[1] = AddressHighChar;
	CmdPacket[2] = AddressLowChar;
	CmdPacket[3] = ' ';
	CmdPacket[4] = 'S';
	CmdPacket[5] = 'C';
	CmdPacket[6] = 'A';
	CmdPacket[7] = 'N';
	CmdPacket[8] = '\r';
	CmdPacket[9] = '\n';

	//send the command
	WriteToGpioPin(RS485_DIR2,1);
//	USART_ClearFlag(&UART4, UART_FLAG_TC);
	__HAL_UART_CLEAR_FLAG(&huart4,UART_FLAG_TC);
	for(Loop = 0; Loop < 10; Loop++)
	{
//		USART_SendData(&UART4,CmdPacket[Loop] & 0x1FF);
		HAL_UART_Transmit(&huart4, CmdPacket[Loop] & 0x1FF , sizeof(CmdPacket[Loop] & 0x1FF), HAL_MAX_DELAY);
//		while (USART_GetFlagStatus(&UART4, UART_FLAG_TC) == RESET);
		while(__HAL_UART_GET_FLAG(&huart4,UART_FLAG_TC) == RESET);
	}
	WriteToGpioPin(RS485_DIR2,0);

	//receive data
	Status = HAL_UART_Receive(&huart4, RdpDataPacket, sizeof(RdpDataPacket), HAL_MAX_DELAY);
//	Status = ReceiveUsartPacket(&UART4, RdpDataPacket, 9, 10000);

	if(Status)
		return(-1);

	//data OK, time to parse the value
	for(Loop = 0; Loop < sizeof(NumberStr); Loop++)
		NumberStr[Loop] = 0x00;
	for(Loop = 0; Loop < 7; Loop++)
		NumberStr[Loop] = (char)RdpDataPacket[Loop];
	*MeasVal = atof(NumberStr);

	return(0);
}
//*--------------------------------------------------------------------------------------
//* Function Name         : RdpTest
//* Object                : Test RDP presence using the sys command
//*
//* Input Parameters      : unsigned char RdpAddress - RS485 address
//* Output Parameters     : returns status (0 - OK, other value - ERROR)
//*--------------------------------------------------------------------------------------

int RdpTest(unsigned char RdpAddress)
{
unsigned char CmdPacket[10];
int Status;
unsigned char RdpDataPacket[20];
unsigned int Loop;
//char NumberStr[10];
char AddressHighChar;
char AddressLowChar;			  //01234567890123456789
unsigned char RdpTestPacket[19] = {"E725 Version 1.10\r\n"};

	//get the address characters
	AddressHighChar = RdpAddress;
	AddressHighChar >>= 4;
	if(AddressHighChar < 10)
		AddressHighChar += 0x30;
	else
		AddressHighChar += 0x37;

	AddressLowChar = RdpAddress;
	AddressLowChar &= 0x0F;
	if(AddressLowChar < 10)
		AddressLowChar += 0x30;
	else
		AddressLowChar += 0x37;

	//prepare the command string
	CmdPacket[0] = '#';
	CmdPacket[1] = AddressHighChar;
	CmdPacket[2] = AddressLowChar;
	CmdPacket[3] = ' ';
	CmdPacket[4] = 'S';
	CmdPacket[5] = 'Y';
	CmdPacket[6] = 'S';
	CmdPacket[7] = '\r';
	CmdPacket[8] = '\n';

	//send the command
	WriteToGpioPin(RS485_DIR2,1);
//	USART_ClearFlag(&UART4, UART_FLAG_TC);
	__HAL_UART_CLEAR_FLAG(&huart4,UART_FLAG_TC);
	for(Loop = 0; Loop < 9; Loop++)
	{
//		HAL_UART_Transmit(&huart, buffer , sizeof(buffer), HAL_MAX_DELAY);
		HAL_UART_Transmit(&huart4, CmdPacket[Loop] & 0x1FF , sizeof(CmdPacket[Loop] & 0x1FF), HAL_MAX_DELAY);
//		USART_SendData(&UART4,CmdPacket[Loop] & 0x1FF);
//		while (USART_GetFlagStatus(&UART4, UART_FLAG_TC) == RESET);
		while(__HAL_UART_GET_FLAG(&huart4,UART_FLAG_TC) == RESET);
	}
	WriteToGpioPin(RS485_DIR2,0);


	//receive data
	Status = HAL_UART_Receive(&huart4, RdpDataPacket, sizeof(RdpDataPacket), HAL_MAX_DELAY);
//	Status = ReceiveUsartPacket(&UART4, RdpDataPacket, 19, 10000);
	if(Status)
		return(-1); //error
	//test data string
	for(Loop = 0;Loop < 19;Loop++)
	{
		if(RdpDataPacket[Loop] != RdpTestPacket[Loop])
			break;
	}
	if(Loop != 19)
		return(-2);	//error
	else
		return(0);	//OK
}


void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

//*-----------------------------end of file RADM_system.c--------------------------------
